import { NextApiRequest, NextApiResponse } from "next"

const LocationsUA = {
   location_id:[1,2,3,4],
   location_name:["Замогилля","Зіркові пустки","Лиурнія","Вершини велетнів"],
   location_text:["Замогилля - область, розташована далеко на південь від Древа Ерд, - простягається до північно-західних скель Грозової Завіси. Під його похмурими небесами розкинулися великі степи.Регіон включає безліч основних типів противників, які допомагають гравцям вивчати основи цього світу. Він містить безліч секретів та ворогів.","Зоряні пустки — це безкраї криваво-червоні долини та високі смертоносні скелі, небезпечні отруйні болота та загадкові руїни. Тут керують небачені монстри, на вершині ієрархії яких сидять дракони.","Землі Ліурнії,відомі безмежними лісами та вічним туманом, майже повністю затоплені.Східним і західним узбережжям пролягають тракти, а над північною частиною височить Академія Раї Лукарії.","Вершини велетнів — це віддалений регіон далекої півночі, куди герой потрапляє після перемоги над нинішнім правителем континенту, Морготом. Холодний і суворий, він містив багато таємниць. Тут можна зустріти і залишки давно зниклої імперії тролів і загублених у хуртовини драконів; самотні заселені монстрами застави та обмерзлі підземні печери.Багато секретів приховують вершини велетнів."],
   location_image:["grave-bg","star-bg","liurnia-bg","giants-bg"]
}

const GetLocationsInfo = async (req:NextApiRequest,res:NextApiResponse) => {
    const LocationsData = LocationsUA.location_id.map((id,index) => (
       { location_id:id,
         location_name:LocationsUA.location_name[index],
         location_text:LocationsUA.location_text[index],
         location_image:LocationsUA.location_image[index]
       }
    ))
   
    res.setHeader("Content-Type",'application/json')
    res.status(200).json(LocationsData)
}

export default GetLocationsInfo