import { NextApiRequest, NextApiResponse } from "next"

export const NewsUA = {
   news_id:[1,2,3,4],
   news_name:["Заплановане обслуговування серверів","Попередження про потенційні шахрайські сайти","Нова система паритету зброї"," Додано нове підземелля для дослідження"],
   news_text:["Дорогі гравці, ми хочемо вас повідомити, що 15 вересня 2024 року з 03:00 до 07:00 за київським часом буде проведено планове технічне обслуговування серверів. Під час цього періоду доступ до гри буде обмежений. Ми приносимо свої вибачення за можливі незручності та дякуємо за ваше розуміння."," Увага, гравці! Ми отримали повідомлення про шахрайські вебсайти, що видають себе за офіційні ресурси Elden Ring. Ми наполегливо рекомендуємо бути обережними та завжди перевіряти джерело інформації, щоб уникнути ризику втрати облікових даних або доступу до гри."," У останньому оновленні Elden Ring була впроваджена нова система паритету зброї, яка дозволяє краще збалансувати гру. Гравці тепер зможуть відчути більш рівні умови при використанні різних типів зброї, що робить бойові дії ще цікавішими."," Гравці, готуйтеся до нових пригод! Оновлення додало нове підземелля 'Темні руїни', де вас чекають нові виклики, потужні вороги та унікальні предмети. Не пропустіть шанс дослідити це місце та отримати цінні нагороди."],
   news_type:["Notice","Notice","Updates","Updates"],
   news_date:["09.01.2024","08.27.2024","07.15.2024","09.04.2024"]
}

const GetNewsDataUA =  async (req:NextApiRequest,res:NextApiResponse) => {
    const NewsList = NewsUA.news_id.map((id, index) => ({
      news_id: id,
      news_name: NewsUA.news_name[index],
      news_text: NewsUA.news_text[index],
      news_type: NewsUA.news_type[index],
      news_date: NewsUA.news_date[index]
    }))

    res.status(200).json(NewsList);
}

export default GetNewsDataUA

